In [1]:
import pandas as pd

In [11]:
cast=pd.read_csv("D:\cast.csv")

In [12]:
cast.head()

,title,year,name,type,character,n
0,Closet Monster,2015.0,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985.0,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017.0,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015.0,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015.0,$hutter,actor,1988 Opera House Patron,NaN

In [ ]:
### How many movies are listed in the titles dataframe?

In [27]:
data=cast.copy()
data['title'].shape[0]

2159949

In [ ]:
### What are the earliest two films listed in the titles dataframe?

In [43]:
data=cast.copy()
data["year"]=pd.to_numeric(data["year"])
data.sort_values(by="year").head(2)

,title,year,name,type,character,n
464860,Miss Jerry,1894.0,William Courtenay,actor,Mr. Hamilton,NaN
555929,Miss Jerry,1894.0,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN

In [34]:
### How many movies have the title "Hamlet"?

In [46]:
data[data["title"]=="Hamlet"].shape[0]

218

In [ ]:
### How many movies are titled "North by Northwest"?

In [47]:
data[data["title"]=="North by Northwest"].shape[0]

81

In [ ]:
### When was the first movie titled "Hamlet" made?

In [55]:
data[data["title"]=="Hamlet"]["year"].min()

1910.0

In [ ]:
### List all of the "Treasure Island" movies from earliest to most recent.

In [57]:
data[data["title"]=="Treasure Island"].sort_values(by="year")

,title,year,name,type,character,n
1291387,Treasure Island,1918.0,Elmo Lincoln,actor,Prologue Player,NaN
830114,Treasure Island,1918.0,Charles Gorman,actor,Prologue Player,NaN
840745,Treasure Island,1918.0,Joe Grant,actor,Undetermined child role,NaN
909157,Treasure Island,1918.0,Edwin Harley,actor,Prologue Player,NaN
1946119,Treasure Island,1918.0,Lewis Sargent,actor,Ben Gunn,5.0
...,...,...,...,...,...,...
1959741,Treasure Island,1999.0,Richard Schave,actor,Man,21.0
872384,Treasure Island,1999.0,Paul Gutrecht,actor,Some Guy,20.0
210668,Treasure Island,1999.0,Jonah Blechman,actor,The Body,3.0
1869989,Treasure Island,1999.0,Scot Thomas Robinson,actor,Jimmy,11.0
880460,Treasure Island,1999.0,Rio Hackford,actor,Hans,23.0

In [ ]:
### How many movies were made in the year 1950?

In [60]:
data[data["year"]==1950].shape[0]

14653

In [ ]:
### How many movies were made in the year 1960?

In [61]:
data[data["year"]==1960].shape[0]

11551

In [ ]:
### How many movies were made from 1950 through 1959?

In [63]:
data[(data["year"]>=1950) & (data["year"]<=1959)].shape[0]

137408

In [ ]:
### In what years has a movie titled "Batman" been released?

In [66]:
batman_movies=data[data["title"]=="Batman"]
batman_movies[["title","year"]]

          title    year
95672    Batman  1943.0
96186    Batman  1943.0
114034   Batman  1989.0
119476   Batman  1989.0
149767   Batman  1989.0
...         ...     ...
2068050  Batman  1989.0
2096318  Batman  1989.0
2099960  Batman  1989.0
2115809  Batman  1989.0
2152546  Batman  1989.0

[89 rows x 2 columns]

In [ ]:
### How many roles were there in the movie "Inception"?

In [73]:
roles=data[data["title"]=="Inception"][["character"]]
len(roles['character'].unique())

42

In [ ]:
### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [92]:
roles=data[data["title"]=="Inception"][["n"]].isnull().sum()
roles

n    21
dtype: int64

In [ ]:
### But how many roles in the movie "Inception" did receive an "n" value?

In [93]:
roles=data[data["title"]=="Inception"][["n"]].notnull().sum()
roles

n    31
dtype: int64

In [ ]:
### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [97]:
data[
    (data["title"] == "North by Northwest") &
    (data["n"].notna())
].sort_values(by="n")

,title,year,name,type,character,n
840374,North by Northwest,1959.0,Cary Grant,actor,Roger O. Thornhill,1.0
1404704,North by Northwest,1959.0,James Mason,actor,Phillip Vandamm,3.0
343701,North by Northwest,1959.0,Leo G. Carroll,actor,The Professor,5.0
1634552,North by Northwest,1959.0,Philip Ober,actor,Lester Townsend,7.0
1229083,North by Northwest,1959.0,Martin Landau,actor,Leonard,8.0
1746383,North by Northwest,1959.0,Edward Platt,actor,Victor Larrabee,10.0
642085,North by Northwest,1959.0,Robert Ellenstein,actor,Licht,11.0
447893,North by Northwest,1959.0,Philip Coolidge,actor,Dr. Cross,13.0
1454363,North by Northwest,1959.0,Patrick McVey,actor,Sergeant Flamm,14.0
198496,North by Northwest,1959.0,Edward Binns,actor,Captain Junket,15.0
1334726,North by Northwest,1959.0,Ken Lynch,actor,Charley - Chicago Policeman,16.0

In [ ]:
### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [101]:
data[
    (data["title"] == "Sleuth") &
    (data["year"]==1972)&
    (data["n"].notna())
].sort_values(by="n")

,title,year,name,type,character,n
1644328,Sleuth,1972.0,Laurence Olivier,actor,Andrew Wyke,1.0
314691,Sleuth,1972.0,Michael Caine,actor,Milo Tindle,2.0
360365,Sleuth,1972.0,Alec Cawthorne,actor,Inspector Doppler,3.0
1412647,Sleuth,1972.0,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1396572,Sleuth,1972.0,Teddy Martin,actor,Police Constable Higgs,6.0

In [ ]:
### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [100]:
data[
    (data["title"] == "Sleuth") &
    (data["year"]==2007) &
    (data["n"].notna())
].sort_values(by="n")

          title    year           name   type    character    n
314692   Sleuth  2007.0  Michael Caine  actor       Andrew  1.0
1246855  Sleuth  2007.0       Jude Law  actor         Milo  2.0
1741124  Sleuth  2007.0  Harold Pinter  actor  Man on T.V.  3.0

In [ ]:
### How many roles were credited in the silent 1921 version of Hamlet?

In [117]:
data[(data["title"]=="Hamlet") & (data["year"]==1921)]["character"].shape[0]

5

In [ ]:
### How many roles were credited in Branagh’s 1996 Hamlet?

In [113]:
data[(data["title"]=="Hamlet") & (data["year"]==1996) ].shape[0]

38

In [ ]:
### How many "Hamlet" roles have been listed in all film credits through history?

In [114]:
data[(data["title"]=="Hamlet")].shape[0]

218

In [ ]:
### How many people have played an "Ophelia"?

In [116]:
data[(data["character"]=="Ophelia")]["name"].nunique()

7

In [ ]:
### How many people have played a role called "The Dude"?

In [118]:
data[(data["character"]=="The Dude")]["name"].nunique()

16

In [ ]:
### How many people have played a role called "The Stranger"?

In [119]:
data[(data["character"]=="The Stranger")]["name"].nunique()

173

In [ ]:
### How many roles has Sidney Poitier played throughout his career?

In [120]:
data[(data["name"]=="Sidney Poitier")]["name"].shape[0]

43

In [ ]:
### How many roles has Judi Dench played?

In [123]:
data[(data["name"]=="Judi Dench")]["name"].shape[0]

0

In [ ]:
### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [125]:
data[(data["name"]=="Cary Grant") & (data["year"]>=1940) & (data["year"]<=1949)& (data["n"]==2)]["name"].shape[0]

2

In [ ]:
### List the leading roles that Cary Grant played in the 1940s in order by year.

In [126]:
data[(data["name"]=="Cary Grant") & (data["year"]>=1940) & (data["year"]<=1949)& (data["n"]==1)]["name"].shape[0]

19

In [ ]:
### How many roles were available for actors in the 1950s?

In [137]:
len(data[(data["year"].between(1950, 1959)) &  (data["type"] == "actor")])

137408

In [ ]:
### How many roles were available for actresses in the 1950s?

In [141]:
len(data[(data["year"].between(1950, 1959)) &  (data["type"] == "actress")])

0

In [ ]:
### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [142]:
len(data[(data.n == 1) & (data.year <= 1980)])

38187

In [ ]:
### How many non-leading roles were available through from the beginning of film history through 1980?

In [145]:
len(data[(data.n > 1) & (data.year <= 1980)])

403168

In [ ]:
### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [146]:
len(data[(data.n.isna()) & (data.year <= 1980)])

299849